; domain
(define (domain blocksworld-domain)
 (:requirements :strips :typing :constraints :action-costs)
 (:types block)
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (increase (total-cost) 1)))
)

; problem
(define (problem blocksworld-problem)
 (:domain blocksworld-domain)
 (:objects
   purple_block_1 white_block_1 grey_block_1 brown_block_1 black_block_1 black_block_2 purple_block_2 - block
 )
 (:init (ontable purple_block_1) (ontable white_block_1) (ontable grey_block_1) (ontable brown_block_1) (ontable black_block_1) (on black_block_2 black_block_1) (on purple_block_2 purple_block_1) (clear white_block_1) (clear grey_block_1) (clear brown_block_1) (clear black_block_2) (clear purple_block_2) (handempty) (= (total-cost) 0))
 (:goal (and (holding purple_block_1)))
 (:constraints (sometime (clear purple_block_1)) (sometime-before (clear purple_block_1) (or (holding brown_block_1) (clear black_block_1))) (sometime (holding grey_block_1)) (always (not (ontable purple_block_2))))
 (:metric minimize (total-cost))
)

; plan
1. (unstack black_block_2 black_block_1)
   deleted: (on black_block_2 black_block_1) (clear black_block_2) (handempty)
   added: (holding black_block_2) (clear black_block_1)
   goals met: 0 of 1
2. (stack black_block_2 white_block_1)
   deleted: (clear white_block_1) (holding black_block_2)
   added: (handempty) (clear black_block_2) (on black_block_2 white_block_1)
   goals met: 0 of 1
3. (pickup grey_block_1)
   deleted: (clear grey_block_1) (ontable grey_block_1) (handempty)
   added: (holding grey_block_1)
   goals met: 0 of 1
4. (stack grey_block_1 black_block_1)
   deleted: (clear black_block_1) (holding grey_block_1)
   added: (handempty) (clear grey_block_1) (on grey_block_1 black_block_1)
   goals met: 0 of 1
5. (unstack purple_block_2 purple_block_1)
   deleted: (on purple_block_2 purple_block_1) (clear purple_block_2) (handempty)
   added: (holding purple_block_2) (clear purple_block_1)
   goals met: 0 of 1
6. (stack purple_block_2 brown_block_1)
   deleted: (clear brown_block_1) (holding purple_block_2)
   added: (handempty) (clear purple_block_2) (on purple_block_2 brown_block_1)
   goals met: 0 of 1
7. (pickup purple_block_1)
   deleted: (clear purple_block_1) (ontable purple_block_1) (handempty)
   added: (holding purple_block_1)
   goals met: 1 of 1
